package io.sugo.kafka;

import io.sugo.kafka.cache.SessionCache;
import io.sugo.kafka.common.IpInfo;
import org.apache.commons.io.FileUtils;
import org.apache.commons.io.LineIterator;
import org.apache.commons.lang.StringUtils;
import org.joda.time.DateTime;

import java.io.File;
import java.io.IOException;
import java.io.UnsupportedEncodingException;
import java.security.MessageDigest;
import java.security.NoSuchAlgorithmException;
import java.util.ArrayList;
import java.util.List;
import java.util.Random;

/**
 * Created by gary on 16-10-26.
 */
public class UserAction {
    private static Random rdint = new Random();
    private static SessionCache sessionCache = new SessionCache();
    private static String[] netWorks= {"wifi","4g","3g","2g", "其他"};
    private static String[] sysVersions= {"1.0.0","1.0.1","1.0.3","1.0.4","1.0.5"};
    private static String[] deviceBrand = {"apple", "HUWEI", "xiaomi", "OPPO", "samsung"};
    private static String[] deviceModel = {"iphone 6", "GEM-702L", "2014813", "X9077", "SM-A5100"};
    private static String[] deviceAgent = {"ios", "android", "android", "android", "android"};
    private static String[] deviceVersion = {"9.0.0", "3.10.61-g48bee2c", "4.4.4", "4.4.4", "5.1.1"};
    private static String[] osScreen = {"375*667", "1830*1200", "1280*720", "2560*1440", "1920*1080"};
    private static String[] eventScreen = {"APP被唤醒","APP结束","APP启动","APP推广活动-DEMO","APP转入后台","e帆网主页","办理推荐业务","办理推荐业务查询","帮得佳产品列表","帮得佳家居用品","帮得佳商品列表","报表指南","报酬查询","奔跑吧！伙伴！","毕寒风","编辑分组","编辑购物车","编辑栏目","编辑收藏夹","编辑我的订阅","编辑我的故事","参加测评","参与讨论","参与讨论96db9844e18b422faedd54e064d9fa2f","草稿单","草稿单详情","测评结果","测评题目","测试ipad端","产品","产品及配件","产品扫码","产品套装商品列表","出团礼仪","出团礼仪详细内容13113","创建我的故事","创建我的故事null","创业成长","创业成长个人报表","创业成长市场报表","创业启航-1","创业启航-2","创业启航-活动1","创业启航-活动2","创业四重奖","创业腾飞","创业腾飞个人报表","创业腾飞市场报表","创业小算盘","萃雅","萃雅产品列表","萃雅护产品列表","萃雅护肤品","萃雅护肤品产品列表","萃雅商品列表","答案详情","大奖就要刮出来！","贷款支付","贷款支付成功","待结算销售单详情","当月发票处理进度","登录","电子出版物","电子券","电子券详情","定制信息","定制信息Hhh ","定制信息ybb","定制信息测试","定制信息高圆圆","定制信息我","董事长寄语","多媒体","发布问题","发票信息查询","反馈历史","反馈详情2b246b6e031c4bd7bffcfd3a1489d893","反馈详情6d7411b672e64ea8815fda23cdcef51a","反馈详情f3f38ffee63b4c59916d51225381e4ba","返回","分享","分组","分组详情","分组详情577","分组详情578","分组详情579","分组详情580","分组详情581","分组详情582","分组详情583","分组详情584","分组详情585","分组详情586","分组详情null","纷享荟商城积分","服务发票邮件物流查询","服务锦囊","服务中心提货018","服务中心提货单","辅销品商品列表","个人购货","个人购货单","个人空间","个人信息","各分段人数占比情况","跟进报表","更换购货人","恭贺报表","恭贺函","共同目标","购或目录","购货记录","购货明细","购货目录","购货情况详情","购货人信息","购物车","购物车结算","购物车结算成功","关于","官网搜索","官网-头条-Pad","官网信息","官网主页","行程","行程安排OTL000000010777","行程安排OTL000000010974","行程安排OTL000000011106","互动","回执管理","活动1个人业绩报表161582561","活动1个人业绩报表163008268","活动1个人业绩报表332499488","活动1个人业绩报表362592960","活动1个人业绩报表362655179","活动1市场达成报表","活动1市场跟进报表","活动1市场业绩公司占比报表","活动2个人达成报表","活动2个人跟进报表","活动2市场达成报表","活动介绍","活动介绍1","活动介绍2","货款支付","获奖详情大奖就要刮出来！","获奖详情为年会喝彩","获奖详情悦购跃享SHOW","获取e帆网密码","获取密码","获取业务密码","基础组合1","基础组合产品详情1","家居配送","家居配送单","家居配送地址","健康产品","健康产品组合定制","健康食品组合","健康食品组合定制","教育网","教育网主页","结算","结算失败","解决方法","经销商税费委托代征","经销商续约申请","经销商续约申请完成","经销商续约申请信息","经销商续约申请信息确认","经销商续约申请信息完成","经销商续约申请信息预览","经销商资料","精彩回顾","精彩回顾详细内容129","精彩回顾详细内容89","精英人物","景点介绍OTL000000010974","景点介绍OTL000000011106","开票资格","客户详情","课程播放38","课程播放73","课程详情","课程学习","口袋英语","口袋英语详细内容13117","口袋英语详细内容13119","口袋英语详细内容34","扣款明细查询帮助","库存查询","李宝琴","李子斌 梁雪","历史发票处理记录","留言板列表","留言板列表69","留言板详细内容1423","留言板信息65","留言板信息69","留言详细内容1302","马懿","媒眼无限极","密码管理","排行榜","培训积分","平阴阳-阳虚组合2","平阴阳-阴虚组合3","平阴阳-阴虚组合产品详情3","企业介绍","签证指引","签证指引VPM000000010922","签证指引VPM000000011013","签证指引详细内容VPM000000010922","潜在顾客详情","热门推荐","热销产品商品列表","热销商品列表","人物故事","日报表","日程表","日程管理","日程搜索","筛选条件","商品搜索","商品详情18002-03","商品详情18003-03","商品详情18013-02","商品详情18039-02","商品详情18040-02","商品详情18068-01","商品详情18096-02","商品详情91000008","使用帮助","事件详情","事业助手","收藏夹","收货地址","收货地址---","收货地址管理","手输码","爽游易","税费委托代征","税费委托代征信息","搜索","他/她的故事","他的业绩158063396","他的业绩161582561","他的业绩161723608","他的业绩362592960","添加分组","添加服务中心","添加家居配送","添加客户","添加潜在顾客","添加日程","添加专卖店","调脏腑-活血通脉6","调脏腑-健脾养胃组合4","调脏腑-健脾养胃组合产品详情4","调脏腑-润肠通便组合9","调脏腑-润肺利咽组合10","调脏腑-养阴生津组合8","调脏腑-益气补血组合7","调脏腑-益气养阴组合5","图库","推荐业务","推荐业务查询","往期报表","忘记e帆网密码","忘记业务密码","为年会喝彩","委托代扣","委托代扣撤销","委托代扣更改","委托代扣开通","委托代扣开通成功","委托代征扣款明细","委托代征状态","未知","问答","问卷调查","问卷详情","问题详情","问题详情873a761b82074c24bc0613def99189b7","问题详情96db9844e18b422faedd54e064d9fa2f","我的","我的订阅","我的购货情况","我的故事","我的顾客","我的行程OTL000000011106","我的行程详情OTL000000010974","我的行程详情OTL000000011106","我的回答","我的积分","我的礼品","我的名片","我的潜在顾客","我的潜在顾客潜在顾客详情","我的收藏","我的提问","我的消息","我的消息详情","我的学分","我的学习","我的用户协议","我的-用户协议","我的优惠卡","我的账户","我的足迹","我要留言65","我要留言69","无法获取页面标题","无限极产品列表","无限极产品详情18002-03","无限极产品详情18003-03","无限极产品详情18010-01","无限极产品详情18013-02","无限极产品详情18014-02","无限极产品详情18016-01","无限极产品详情18035-01","无限极产品详情18041-01","无限极产品详情18047-01","无限极产品详情18065-01","无限极产品详情18068-01","无限极产品详情18081-02","无限极产品详情18084-01","无限极产品详情18105-01","无限极产品详情18120-01","无限极产品详情18120-02","无限极产品详情18136-01","无限极产品详情18144-01","无限极产品详情18901-03","无限极健康食品","无限极健康食品18081-02","无限极健康食品18136-01","无限极健康食品18144-01","无限极健康食品产品列表","无限极商品列表","无限极微刊","系统化自评","系统设置","下属市场自评明细","详细内容","详细资料","享优乐产品列表","享优乐产品详情18402-02","享优乐产品详情18404-01","享优乐商品列表","享优乐养生用品","项目测评情况","消费积分","消息公告","消息公告消息详情","消息列表","消息详情","消息详情ID39c95e10d2294d8bb74c05cc8e6de3fa","消息详情IDad9f4dfd0f064872afd96edd3f63ccf0","销售单查询","销售单查询结果","销售单结算","销售单完结","销售单详情","心维雅产品列表","心维雅产品详情18025-03","心维雅产品详情18052-02","心维雅产品详情18053-02","心维雅产品详情18055-02","心维雅护肤品","心维雅护肤品18092-02","心维雅商品列表","新建事件","新增退货单","新增销售单","修改e帆网密码","修改业务密码","修改资料","宣导视频","宣导视频详细内容100","宣导视频详细内容122","宣导视频详细内容87","选择产品","选择成员","选择客户","选择收货地址","学习提醒","验证身份","杨辉 李萍","养生固本 健康人生","业务办理","业务办理查询","业务办理查询结果","业务查询","业务导航","易售通","用户反馈","用户协议","有奖活动","在线客户","在线推荐","在线推荐协议","账单详情","账户余额","植雅产品列表","植雅产品详情18029-03","植雅产品详情18109-01","植雅个人护理品18073-02","植雅商品列表","制作成功","朱晨 刘莉","主题系列","主题系列0418","主题系列测试0510","专卖店查询","专卖店地址360336721","专卖店地址361250705","专卖店提货单","专题","撰写评价","自我测评情况","走进无限极","最新内容"};
    private static String[] eventAction = {"唤醒","点击","浏览","后台","启动","对焦","退出"};
    private static String[] eventLabel = {"wifi自动下载","按订单","按日期","按所选条件查询","办卡金额1","办卡金额2","帮得佳","帮助","保存","保存并购货","保存并推荐","保存分组","保存潜在顾客","保存资料退出购货","报表指南","报酬查询","报到详情","本月榜单","本周榜单","编辑","编辑订阅","编辑分组","标签","标签内容","标题","播放","不可用","不同意","参观报名","参加测评","参与讨论","草稿单","测评结果","测评题目","测试环境","查看大图","查看地址","查看订单","查看更多教育网资讯","查看更多主题","查看精英","查看开票资格","查看潜在顾客","查看日程","查看他的业绩","查看问题","查看销售单详情","查看新动态","查看支付明细","查询","查询月份","产品","产品介绍","产品类型","产品码","产品扫码","产品数量","产品套装","产品喜好","城市","出团礼仪","出团礼仪信息","创建","创建影集","创业成长","创业成长个人报表","创业成长市场报表","创业启航-1","创业启航-2","创业四重奖","创业腾飞","创业腾飞个人报表","创业腾飞市场报表","创业小算盘","萃雅","答案","打电话","大家都在搜索","贷款支付","单个勾选","单据号","当地汇率","当地时间","当地天气","当月发票处理进度","导入通讯录","登出","登录","登入","地点","地税登记证","地址","第1个月","第2个月","第3个月","第3月达标人数","第3月累计达标人数","第4个月","第4月达标人数","第4月累计达标人数","点赞","电话","电话号码","电子出版物","电子券","电子邮件","店铺类型","订单类型","订单详情","订阅号","订阅内容","定制信息","董事长寄语","动态","短信基础组合","多媒体","发表评论","发短信","发票信息查询","发送","发送验证码","反馈内容","反馈信息","返回","返回e帆网首页","返回所有留言列表","返回我的账户","返税状态","分公司","分享","分组","分组成员","分组名称","纷享荟商城","纷享荟商城积分","服务大厅","服务发票邮件物流查询","服务锦囊","服务支持","服务中心提货","服务中心提货单","辅销品","改一改","个人购货","个人购货单","个人基础信息","个人空间","个人销售金额","个人信息","各分段人数占比情况","跟进报表","更换购货人","更换验证码","公共课","公司","公司地址","公司发货状态","公司实力","功能问题","恭贺报表","恭贺函","共同目标","勾选","勾选潜在顾客","购货","购货明细","购货情况详情","购货人卡号","购货人扫码","购货人姓名","购物车","固定电话","固定电话号码","固定电话区号","顾客购货记录","顾客类型","顾客身份","顾客姓名","关闭","关于","关注问题","官网查看更多","官网信息","管理","广告","归属分公司","国家","国税登记证","核心产品","后台","互动","换一批","唤醒","回复","回复内容","回顾视频","回执管理","活动1个人业绩报表","活动1市场达成报表","活动1市场跟进报表","活动1市场业绩公司占比报表","活动2个人达成报表","活动2个人跟进报表","活动2市场达成报表","活动简介","活动介绍","活动列表","活动信息","货款支付","获奖记录","获奖信息","获取密码","获取手机验证码","积分","基本资料","记录","继续购货","继续新增销售单","加购物车","加收藏","家居配送","家居配送单","减少产品","减少数量","健康产品","健康产品_帮得佳","健康产品_萃雅","健康产品_无限极","健康产品_享优乐","健康产品_心维雅","健康人生","健康食品组合","健康食品组合定制","教育网","教育网查看更多","教育网信息","街道","结束时间","结算","解决方法","今天","仅保存客户资料","进度","进入问卷","经销商续约","经销商资料","精彩回顾","精英风采","精英人物","景点介绍","静态","举报","卡号","卡号/手机号","卡号或手机号","卡号或手机号码","开关","开票资格","开始时间","开始制作","开通","可用","客服热线","客户管理","课程讨论","课程学习","口袋英语","库存查询","类型","历史","历史发票处理记录","历史行程","历史消息","历史与文化","例子","联系电话","联系信息","领导人年会","留言板","留言记录","留言内容","留言信息","流程说明","媒眼无限极","美丽印迹","门牌","密码","密码管理","民族","名","排行榜","排序","培训积分","配偶名","配偶姓","配送地址","配置","批量取消收藏","批量删除","评论","评论内容","其他","企业介绍","启动","签证信息","签证指引","潜在顾客分组","清除缓存","清空","清空所有定制","清空组合","请点我","区县","区域","取消","取消收藏","全部","全部勾选","全选","确定","确定并关闭","确定并继续","确认并提交","确认证件号码","确认支付","热点聚焦","热门推荐","热销产品","日报表","日程管理","日程详情","荣耀时刻","扫码","扫一扫","筛选","筛选条件","删除","删除成员","删除分组","删除故事","商品","商品数量","上传图片","上一题","上一条","上一页","设为常用","设为默认地址","设置","社会责任","身份证反面","身份证正面","生产环境","生日","省份","使用帮助","使用指南","事件详情","事业助手","视频信息","是否更改","是否退换货","是否已婚","收藏","收藏产品","收藏的课程","收藏夹","收货地址","收货状态","收起","收入","手动添加","手机","手机号","手机号码","手机验证码","手输码","首席风采","首页","授权编号","数据平台","爽游易","税费委托代征","税务登记证名称（地）","税务登记证名称（国）","税务登记证注册号（地）","税务登记证注册号（国）","搜索","搜索结果","搜索内容","所需材料","他/她的故事","讨论内容","提货状态","提交","提问","提醒时间","添加","添加产品","添加成员","添加到‘走进无限极’","添加到走近无限极","添加定制","添加分组","添加分组成员","添加服务中心","添加图片","添加相册","通信录","同意","头条","图库","图片上传","推荐标签","推荐业务","推荐业务查询","退出","退出当前账号","退货","完成","往年同住对象","往期报表","忘记e帆网密码","忘记密码","忘记业务密码","忘记用户名","微信好友","微信好友*安会的名片","微信好友黄小明的名片","微信好友于祥的名片","微信联系","微信朋友圈","微信朋友圈*安会的名片","微信朋友圈黄小明的名片","微信朋友圈于祥的名片","微信收藏","微信支付","为顾客定制健康食品组合","委托代扣","委托代扣撤销","委托代扣更改","委托代征扣款明细","委托代征状态","问答","问卷","问卷调查","问题","问题内容","我的","我的订阅","我的购货情况","我的故事","我的顾客","我的行程","我的回答","我的礼品","我的留言","我的名片","我的潜在顾客","我的提问","我的消息","我的学习","我的优惠卡","我的足迹","我的昨天、今天","我要开通","我要留言","无限极","无限极微刊","物流状态","系统公告","系统化自评","下单时间","下属市场自评明细","下一步","下一题","下一条","下一页","下载","下载的课程","相关知识","享优乐","消费积分","消息","销售单查询","销售单号","销售单类型","销售单详情","销售时间","小孩个数","心维雅","新e帆网密码","新行程","新行程记录","新新","新业务密码","新增","新增退货单","新增销售单","信息","星级顾客","兴趣爱好","性别","姓","姓别","姓名","修改","修改e帆网密码","修改业务密码","需跟进","宣导视频","选择","选择产品","选择基础组合","选择潜在顾客","选择线路","学分","学习排行","学习时长","学习提醒","验证码","养生固本 健康人生","邀请","业绩结束月份","业绩开始月份","业务办理","业务办理查询","业务查询","业务导航","业务密码","已阅并同意","已阅读并同意","易售通","意见反馈","音量","银行地区","银行类型","银行名称","银行账号","英语信息","营业场所","营业执照","营业执照号码","营业执照名称","营业执照注册号","用户名","用户协议","优化建议","邮箱","邮政编码","有奖活动","预览","预览客户资料","原e帆网密码","原业务密码","阅读全文","运作资讯","再次核对","再次输入新e帆网密码","再次输入新业务密码","再次输入支付金额","再下单","在线推荐","增加","增加产品","增加数量","展开问题","账号类型","账号信息","账户余额","镇区","证件号","证件号码","证件类型","支出","支付","支付金额","职位","植雅","重复","重命名","主题系列","注册地区","注销","注意事项","专卖店","专卖店查询","专卖店卡号","专卖店收货状态","专卖店提货单","专题","转发","状态","咨询投诉","自我测评情况","自选入住","走进无限极","组合产品"};
    private static String[] nations= {"北京市","天津市","河北省","山西省","内蒙古"
            ,"辽宁省","吉林省","黑龙江","上海市"
            ,"江苏省","浙江省","安微省","福建省","江西省","山东省","河南省","湖北省","湖南省","广东省","广西省","海南省"
            ,"重庆市","四川省","贵州省","云南省","西藏","陕西省","甘肃省"
            ,"青海省","宁夏","新疆","台湾"
            ,"香港","澳门"};
    private static String[] isps = {"电信", "联通", "移动"};

    private static List<String> areas = getAreas("area.txt");

    private static List<String> getAreas(String file)  {

        try {
            LineIterator it = FileUtils.lineIterator(new File(file), "UTF-8");
            List<String> list = new ArrayList<>();
            while (it.hasNext()) {
                String[] pairs = it.next().split("\t");
                if (pairs.length == 1) {
                    continue;
                }

                list.add(pairs[0]);
            }

            return list;
        } catch (IOException e) {
            throw new RuntimeException(e);
        }
    }

    public static String getAction(DateTime time) throws Exception
    {
        String IP = getRandomIp();
        IpInfo ipInfo = getIpInfo(IP);
        StringBuffer sb = new StringBuffer();
        sb.append("IP="+ encode(IP)).append("&");

        if (ipInfo != null) {
            sb.append("Nation="+encode(ipInfo.getCountry())).append("&");
            sb.append("Province="+encode(ipInfo.getRegion())).append("&");
            sb.append("City="+encode(ipInfo.getCity())).append("&");
            sb.append("Operator="+encode(ipInfo.getIsp())).append("&");
        } else {
            sb.append("Nation="+encode("未知")).append("&");
            sb.append("Province="+encode("未知")).append("&");
            sb.append("City="+encode("未知")).append("&");
            sb.append("Operator="+encode("未知")).append("&");
        }

        sb.append("Network="+encode(netWorks[rdint.nextInt(netWorks.length-1)])).append("&");
        sb.append("SystemName="+encode(getSystemName())).append("&");
        int i = rdint.nextInt(4);
        sb.append("SystemVersion="+encode(sysVersions[i])).append("&");
        sb.append("ClientDeviceBrand="+encode(deviceBrand[i])).append("&");
        sb.append("ClientDeviceModel="+encode(deviceModel[i])).append("&");
        sb.append("ClientDeviceAgent="+encode(deviceAgent[i])).append("&");
        sb.append("ClientDeviceVersion="+encode(deviceVersion[i])).append("&");
        sb.append("OsScreen="+encode(osScreen[i])).append("&");
        String userId = getDeviceId();
        sb.append("UserID="+encode(userId)).append("&");
        sb.append("SessionID="+encode(sessionCache.getSessionId(userId))).append("&");
        sb.append("ClientDeviceID="+encode(sessionCache.getDeviceId(userId))).append("&");
        sb.append("EventDateTime="+time.getMillis()).append("&");
        sb.append("EventScreen="+encode(eventScreen[rdint.nextInt(eventScreen.length-1)])).append("&");
        String action  = eventAction[rdint.nextInt(eventAction.length-1)];
        sb.append("EventAction="+encode(action)).append("&");
        if ("点击".equals(action) || "对焦".equals(action)) {
            sb.append("EventLabel="+encode(eventLabel[rdint.nextInt(eventLabel.length-1)]));
        }
        return sb.toString();
    }

    public static String encode(String str) throws UnsupportedEncodingException {
        if (StringUtils.isEmpty(str)) {
            return "";
        }
        return str;
//        return URLEncoder.encode(str, "UTF-8");
    }

    public static IpInfo getIpInfo(String ip)
    {
        if ("63.149.98.170".equals(ip)) {
            return new IpInfo("美国");
        } else {
            return new IpInfo(
                    "中国",
                    nations[rdint.nextInt(nations.length-1)],
                    "",
                    isps[rdint.nextInt(isps.length-1)]
            );
        }
//        try {
//            CloseableHttpResponse response = http.execute(new HttpGet("http://ip.taobao.com/service/getIpInfo.php?ip=" + ip));
//            if (response.getStatusLine().getStatusCode() == 200) {
//                return jsonMapper.readValue(
//                    jsonMapper.readTree(response.getEntity().getContent()).get("data").toString(),
//                    IpInfo.class
//                );
//
//
//            }
//        } catch (IOException e) {
//            e.printStackTrace();
//        }
//        return null;
    }

//    public static String getNation()
//    {
//        String[] arr= {"中国","俄罗斯","局域网","美国"};
//        int index = rdint.nextInt(arr.length-1);
//        return arr[index];
//    }


    public static String getSystemName()
    {
        return "WuxianjiApp";
    }

    public static String getDeviceId() throws NoSuchAlgorithmException {
        MessageDigest md = MessageDigest.getInstance("MD5");
        md.update(String.valueOf(rdint.nextInt(1000)).getBytes());
        byte[] digest = md.digest();
        StringBuffer sb = new StringBuffer();
        for (byte b : digest) {
            sb.append(String.format("%02x", b & 0xff));
        }
        return sb.toString();
    }


//    public static String getProvince()
//    {
//        String[] arr= {"北京市","天津市","河北省","山西省","内蒙古","辽宁省","吉林省","黑龙江","上海市"
//                ,"江苏省","浙江省","安微省","福建省","江西省","山东省","河南省","湖北省","湖南省","广东省","广西省","海南省"
//                ,"重庆市","四川省","贵州省","云南省","西藏","陕西省","甘肃省"
//                ,"青海省","宁夏","新疆","台湾","香港","澳门","国外"};
//        int index = rdint.nextInt(arr.length-1);
//        return arr[index];
//    }

    public static String getRandomIp()
    {
        if (rdint.nextInt() % 7 == 0) {
            return "63.149.98.170";
        }
        //ip范围
        int[][] range = {{607649792,608174079},//36.56.0.0-36.63.255.255
                {1038614528,1039007743},//61.232.0.0-61.237.255.255
                {1783627776,1784676351},//106.80.0.0-106.95.255.255
                {2035023872,2035154943},//121.76.0.0-121.77.255.255
                {2078801920,2079064063},//123.232.0.0-123.235.255.255
                {-1950089216,-1948778497},//139.196.0.0-139.215.255.255
                {-1425539072,-1425014785},//171.8.0.0-171.15.255.255
                {-1236271104,-1235419137},//182.80.0.0-182.92.255.255
                {-770113536,-768606209},//210.25.0.0-210.47.255.255
                {-569376768,-564133889}, //222.16.0.0-222.95.255.255
        };

        int index = rdint.nextInt(10);
        String ip = num2ip(range[index][0]+rdint.nextInt(range[index][1]-range[index][0]));
        return ip;
    }

    private static String num2ip(int ip) {
        int [] b=new int[4] ;
        String x = "";

        b[0] = (int)((ip >> 24) & 0xff);
        b[1] = (int)((ip >> 16) & 0xff);
        b[2] = (int)((ip >> 8) & 0xff);
        b[3] = (int)(ip & 0xff);
        x=Integer.toString(b[0])+"."+Integer.toString(b[1])+"."+Integer.toString(b[2])+"."+Integer.toString(b[3]);

        return x;
    }
}
